## DATA SCIENCE

In [1]:
import pandas as pd
import os
import numpy as np

In [17]:
path='csvs'
csvs=os.listdir(path)
dfs=[pd.read_csv(os.path.join(path,csv)) for csv in csvs if '.csv' in csv]

In [232]:
test=pd.concat(dfs,sort=False).reset_index(drop=True).loc[:,['titulo','empresa','descripcion']]
test1=test.drop_duplicates().reset_index(drop=True)
test2=test.drop_duplicates(subset=['titulo','empresa'],keep='last').reset_index(drop=True)

In [238]:
des1=list(set(test1.descripcion).difference(set(test2.descripcion)))

In [227]:
test1[(test1['descripcion']==des1[0]) | (test1['descripcion']==des1[1]) | (test1['descripcion']==des1[2]) |
     (test1['descripcion']==des1[3]) | (test1['descripcion']==des1[4]) | (test1['descripcion']==des1[5])
     | (test1['descripcion']==des1[6]) | (test1['descripcion']==des1[7])]

,titulo,empresa,descripcion
24,Analistas de Datos,Grupo 30 inventos,Somos una agencia con más de 10 años de vida e...
185,Test Engineer,Flex,The Test Engineer . Will be based in Guadalaja...
257,Specification Analyst,John Deere,There are 7 billion people on this planet. And...
261,ADAS Algorithm Development Engineer,Continental AG,Tasks\n\nThe Sensing and Driving Functions Alg...
312,Principal Systems Administrator 2,Skyworks,Principal Business Systems Analyst 2\n\nPositi...
377,Java Developer,IBM,"Introduction\n\nAs an Application Developer, y..."
395,IMPORTANT SOFTWARE COMPANY REQUESTS:,Human Staff,Requirements\n\n 2+ years of professional expe...
445,Credit Risk Analytics Lead,Kueski,"Why Kueski\n\n\n\n""DO TECH SHARE WEALTH""\n\n\n..."

In [235]:
test1[test1['titulo']=='Analistas de Datos']

,titulo,empresa,descripcion
24,Analistas de Datos,Grupo 30 inventos,Somos una agencia con más de 10 años de vida e...
675,Analistas de Datos,Grupo 30 inventos,Somos una agencia con más de 10 años de vida e...

In [236]:
test1[test1['titulo']=='Test Engineer']

,titulo,empresa,descripcion
185,Test Engineer,Flex,The Test Engineer . Will be based in Guadalaja...
690,Test Engineer,Flex,The Test Engineer will be based in Guadalajara...
715,Test Engineer,John Deere,There are 7 billion people on this planet. And...

In [239]:
test1[test1['titulo']=='Specification Analyst']

,titulo,empresa,descripcion
257,Specification Analyst,John Deere,There are 7 billion people on this planet. And...
743,Specification Analyst,John Deere,There are 7 billion people on this planet. And...

In [207]:
test1.shape

(751, 3)

In [225]:
test2.shape

(743, 3)

## Vemos que el caso correcto es el test2, entonces usamos ese

In [244]:
df=test2
df.to_csv('trabajos_datascience.csv',index=False)

## EMPLEOS TOTALES

In [11]:
datasience=pd.read_csv('trabajos_datascience.csv')

In [2]:
path='alljobs_categorias_estado/'
csvs=os.listdir(path)
dfs=[pd.read_csv(os.path.join(path,csv)) for csv in csvs]

In [3]:
test=pd.concat(dfs,sort=False).reset_index(drop=True)
test2=test.drop_duplicates().reset_index(drop=True)

In [4]:
test2.to_csv('trabajos_en_mexico_v3.csv',index=False)